Revit 2020 API
Wood Class
 Represents the properties of materials.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2018.1
Syntax
C#
public static class Wood
Visual Basic
Public NotInheritable Class Wood
Visual C++
public ref class Wood abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Wood
See Also
Wood Members
Autodesk.Revit.DB.Visual Namespace